Repository: SeaweedbrainCY/iLocked
Catalog: iLocked/*.lproj/Localizable.strings
Languages: fr

source: My encryption key
fr: Ma clé de chiffrement

source: Error0003
fr: Impossible d'identifier cette clé. Essayez de la sauvegarder à nouveau. Si cette erreur apparait plusieurs fois, veuillez reporter ce bug avec le code erreur #DATA/AK.SWIFT 0003 🛠. Merci.

source: nameError
fr: Une clé nécessite un petit nom !

source: noKeyError
fr: Veuillez entrer une clé

source: invalidKey
fr: La clé n'est pas valide ! Elle doit être générée par iLocked et ne doit pas être modifié

source: forbiddenError
fr: Ce nom est interdit. Essayez un autre.

source: takenError
fr: Ce nom est déjà pris

source: Please, enter an encrypted text
fr: Veuillez entrer un message chiffré

source: Nothing to paste
fr: Rien à coller

source: helpText
fr: ⚠️ CONFIDENTIALITÉ : iLocked ne conserve ou ne partage JAMAIS (jamais) vos messages ! C'est pourquoi, l'application n'a pas besoin de connexion internet pour chiffrer, déchiffrer ou stocker une clé ! Ce qui est sur votre iPhone, reste sur votre iPhone. 📨Pour déchiffrer un message chiffré avec votre propre clé publique, copiez et collez simplement le texte dans le champ. Appuyez aussi sur le bouton 'déchiffrer'. Une nouvelle fenêtre va être ouverte et donnera le message déchiffré. 🙇IMPORTANT : Assurez vous que votre correspondant a chiffré son message avec votre clé publique et que vous avez copié la totalité du texte reçu. Ni plus, ni moins.

source: Text to decrypt
fr: Texte à déchiffrer

source: Add a key
fr: Ajouter une clé

source: Select a key
fr: Sélectionner une clé

source: Oups ! We got an error !
fr: Oups une erreur est survenue !

source: Impossible to find the encryption key
fr: Impossible de trouver la clé publique

source: alertKeyErrorMessage
fr: Verifiez qu'une clé a bien été sélectionnée. Si tous les champs sont bien remplies, essayez de relancer l'application.

source: ErrorEncryption
fr: Impossible de chiffrer ce message. Essayez à nouveau.

source: Text to encrypt
fr: Texte à chiffrer

source: helpTextEncryption
fr: ⚠️ CONFIDENTIALITÉ : iLocked ne conserve ou ne partage JAMAIS (jamais) vos messages ! C'est pourquoi, l'application n'a pas besoin de connexion internet pour chiffrer, déchiffrer ou stocker une clé ! Ce qui est sur votre iPhone, reste sur votre iPhone. 🔐iLocked utilise le chiffrement RSA-4096, une protection hautement sécurisée, pour chiffrer vos messages. Personne à part le détenteur de la clé privée, associée à la clé publique que vous allez utiliser, ne pourra le déchiffrer. Même vous ! 🙇IMPORTANT : Assurez vous de chiffrer votre message avec la clé publique de la personne à qui vous voulez envoyer le message. Faites attention à bien copier l'intégralité du message chiffré avant de l'envoyer. Ni plus, ni moins.

source: Your message is now encrypted with RSA-4096, a highly secure encryption.
fr: Votre messsage est désormais chiffré avec RSA-4096, un chiffrement hautement securisé.

source: Copied
fr: Copié

source: There is no key saved
fr: Il n'y a pas de clé enregistrée

source: My public encryption key
fr: Ma clé de chiffrement publique

source: Public keys
fr: Clés publiques

source: Impossible to recognize this data
fr: Impossible de reconnaitre cette donnée

source: messageError0004
fr: Re-démarrez iLocked et essayez à nouveau. Code erreur : VC/KL.SWIFT#0004#

source: Close
fr: Fermer

source: Wrong data
fr: Mauvaises données

source: messageError0005
fr: Re-démarrez iLocked et essayez à nouveau. Code erreur : VC/KL.SWIFT#0005#

source: No link between selection and saved data
fr: Impossible d'établir un lien entre la sélection et les données enregistrées

source: messageError0006
fr: Re-démarrez iLocked et essayez à nouveau. Code erreur : VC/KL.SWIFT#0006#

source: Cancel
fr: Annuler

source: Please select some keys
fr: Sélectionnez des clés

source: Got it !
fr: Compris !

source: Destroy
fr: Détruire

source: key
fr: clé

source: Destroy selected keys
fr: Détruire les clés sélectionnées

source: WARNING : You will not be able to undo this action
fr: ATTENTION : Vous ne serez pas capable d'annuler cette action

source: warningPublicKeyUse
fr: N'utilisez pas votre propre clé publique pour chiffrer, sauf si vous voulez garder un secret pour vous-même. Vous êtes le seul capable de déchiffrer un message chiffré avec votre clé publique.

source: ImpossibleFindKey
fr: Impossible de trouver cette clé. Assurez vous d'avoir la dernière version de iLocked et que vous avez assez de place disponible sur votre iDevice.

source: Tips : double tap on the key-text to copy it !
fr: Astuce : Double-tape sur la clé pour la copier !

source: That's your own public key !
fr: C'est votre propre clé publique !

source: ownKeyErrorMessage
fr: Vous ne pouvez pas supprimer votre propre clé publique. Pour révoquer vos clés, allez dans les réglages.

source: Destroy this key
fr: Détruire cette clé

source: ownKeyErrorEdit
fr: Vous ne pouvez pas modifier votre propre clé publique. Pour révoquer vos clés, allez dans les réglages.

source: infoEncryption
fr: Ce message doit être chiffré avec votre propre clé publique et sera déchiffré avec votre clé privée.

source: Please re-start iLocked !
fr: Veuillez re-lancer iLocked !

source: crashAppMessageError
fr: Une erreur est servenue lors de la creation de vos clés. Veuillez réessayer

source: Quit app
fr: Quitter l'app

source: Your data are protected by a password.
fr: Vos données sont protégées par un mot de passe.

source: Authentication failed. 🔒
fr: L'authentification a échouée 🔒

source: 👨‍💻 Support the developer
fr: 👨‍💻 Soutenir le développeur

source: ❌ Revoke your keys
fr: ❌ Révoquer vos clés

source: 🔐 Protect with a password
fr: 🔐 Protéger avec un code

source: 📲 Hide screen in App Switcher
fr: 📲 Cacher l'écran (sélectionneur d'app)

source: Immediatly
fr: Immédiatement

source: 🕐 Lock app
fr: 🕐 Verrouiller l'app

source: 🕹 Show tutorial again
fr: 🕹 Revoir le tutoriel

source: 🔎 Report a bug
fr: 🔎 Reporter un bug

source: 📱 Visit developer website
fr: 📱 Ouvrir le site du développeur

source: ⚙️ Advanced settings
fr: ⚙️ Réglages avancés

source: Developer 👨‍💻
fr: Developpeur 👨‍💻

source: Keys 🔑
fr: Clés 🔑

source: Security 🔐
fr: Sécurité 🔐

source: Time before locking the app with your password
fr: Temps avant que l'app ne soit verrouillée avec votre code

source: Report a bug
fr: Reporter un bug

source: ReportBugMessage
fr: Reporter un bug aide le développeur à améliorer cette application ainsi que votre expérience

source: iOS iLocked : Bug report
fr: iOS iLocked : Report de bug

source: reportBugEmailSetting
fr: ********* Envoyé par iLocked iOS app ********* Report de bug depuis la page des réglages Langue : Français

source: reportBugEmailGeneration
fr: ********* Envoyé par iLocked iOS app ********* Report de bug depuis la page de génération des clés Langue : Français

source: Contact the developer
fr: Contacter le développeur

source: iOS iLocked : Request contact
fr: iOS iLocked : Demande de contact

source: contactEmail
fr: ********* Envoyé par iLocked iOS app ********* Demande de contact depuis la page des réglages Langue : Français

source: Error ! 🔨
fr: Erreur ! 🔨

source: errorMail
fr: Impossible d'utiliser les services de mail

source: An error occured
fr: Une erreur est survenue

source: Please try again
fr: Veuillez réessayer

source: REVOKE
fr: RÉVOQUER

source: confirm keys revocation
fr: Confirmer la révocation des clés

source: Authentication failed
fr: L'authentification a échouée

source: authErrorRevoke
fr: Vous devez vous identifier pour révoquer vos clés. Veuillez ré-essayer.

source: 🔨 Feature coming soon !
fr: 🔨 Fonctionnalité bientôt là !

source: featureComingSoonMessage
fr: L'application iLocked est toujours en développement ! Vous allez bientôt être capable d'ouvrir les liens externes directement dans l'app !Votre choix est enregistré et vous serez notifié lorsque l'option sera disponible.

source: 📲 Open external links in app
fr: 📲 Ouvrir les liens dans l'app

source: 📚 Open Source Libraries
fr: 📚 Les librairies open-source

source: 🛂 Use X.509 certificate
fr: 🛂 Utiliser le certificat X.509

source: Information 📌
fr: Informations 📌

source: X509Description
fr: Si vous rencontrez des difficultés à utiliser votre clé publique avec d'autre outils de chiffrement RSA, essayez de désactiver le certificat X.509. Vous serez alors en mesure de partager votre clé publique sans entête de certification Note : Désactiver cette option n'affecte pas votre clé publique en tant que clé RSA. Cela va uniquement changer son format d'encodage. Par défaut, le certificat X.509 est utilisé pour votre clé publique.

source: Bad format
fr: Mauvais format

source: Bad key
fr: Mauvaise clé

source: formatKeyDecryptionMessage
fr: Le format du chiffré est incorrect. Veuillez uniquement déchiffrer un message chiffré précédemment avec iLocked.

source: can'tAccessErrorMessage
fr: iLocked ne peut pas accéder à votre clé privée.

source: can'tDecryptErrorMessage
fr: Vous ne pouvez pas déchiffrer ce texte. Vous n'avez pas la bonne clé privée. Assurez vous que le message a bien été chiffré avec VOTRE clé publique.

source: 🔑 Export your keys
fr: 🔑 Exporter vos clés

source: Human readable
fr: Lisible (Human readable)

source: WarningOnTableViewExport
fr: ATTENTION : Vous vous apprêtez à exporter votre clé privée, une information extrêmement critique. Vous devez absolument la garder dans un endroit sûr. Ne la partagez pas. Gardez la pour vous seul

source: PEM format and X.509 certificate for the public key
fr: Format PEM et certificat X.509 pour la clé publique

source: PEM format (wihtout X.509 certificate)
fr: Format PEM (sans certificat X.509)

source: Base64 format and X.509 certificate for the public key
fr: Format Base64 et certificat X.509 pour la clé publique

source: Base64 format (wihtout X.509 certificate)
fr: Format Base64 (sans certificat X.509)

source: Unable to retrieve your keys
fr: Impossible de récupérer vos clés

source: impossibleRetrieveErrorMessage
fr: Veuillez réessayer. Si vous voyez ce message plusieurs fois, merci de contacter le développeur.

source: footerExportKeys0
fr: Format X.509 PEM : Format utilisé pour certains outils de chiffrement RSA (comme openSSL). iLocked supporte ce format pour l'importation de clés.

source: footerExportKeys1
fr: Format PEM : Format utilisé pour certains outils de chiffrement RSA (en ligne par ex.). Il est plus flexible mais ne supporte pas le certificat X.509, ce qui peut créer des problèmes de chiffrement avec certains outils. iLocked supporte ce format pour l'importation de clés.

source: footerExportKeys2
fr: Format X.509 Base64 : Format utilisé pour certains outils de chiffrement RSA (en ligne par ex.). iLocked supporte ce format pour l'importation de clés.

source: footerExportKeys3
fr: Format Base64 : Format plus utile et flexible. Il peut être utilisé avec la plupart des outils de chiffrement RSA et peut être facilement converti au format PEM. Mais il ne supporte pas le certificat X.509, ce qui peut créer des problèmes de chiffrement avec certains outils. iLocked supporte ce format pour l'importation de clés.

source: Unable to convert your keys
fr: Impossible de convertir vos clés

source: convertionErrorMessage
fr: Une erreur est survenue au moment d'ajouter vos clés au fichier texte. Verifiez que vous avez assez de place sur votre appareil. Si cela ne marche toujours pas, essayez un autre format et contactez le développeur.

source: convertionErrorMessageLog
fr: Une erreur est survenue au moment d'ajouter vos logs au fichier texte. Verifiez que vous avez assez de place sur votre appareil. Si cela ne marche toujours pas, essayez un autre format et contactez le développeur.

source: 🔥 Premium version
fr: 🔥 Version premium

source: Paste your keys here
fr: Collez vos clés ici

source: Paste your keys (in text format) to import them
fr: Collez vos clés (sous forme de texte) pour les importer.

source: pasteKeyErrorMessage
fr: Collez le texte généré par iLocked lors de l'export des clés. iLocked supporte les formats .txt, Lisible (Human readable), et JSON.

source: Impossible to save your keys
fr: Impossible de sauvegarder vos clés

source: Please check you have enough space in your iDevice.
fr: Vérifiez que vous avez assez de place sur votre appareil

source: Impossible to retrieve your .txt
fr: Impossible de récupérer votre .txt

source: unreachableFIleMessageError
fr: Votre fichier .txt est inatteignable. Veuillez ré-essayer.

source: Impossible to extract your keys
fr: Impossible d'extraitre vos clés

source: extractionErrorMessage
fr: Vos clés ne peuvent pas être extraites. Vous ne pouvez importer qu'un texte généré par iLocked.

source: Impossible to retrieve your keys
fr: Impossible de récupérer vos clés

source: wrongInfoErrorMessage
fr: Vos clés ne peuvent pas être extraites car les informations renseignées sont incorrectes ou corrompues. N'essayez pas d'importer un texte autre que celui généré par iLocked

source: Wrong keys
fr: Mauvaises clés

source: wrongKeysErrorMessage
fr: La clé publique renseignée ne correspond pas à la clé privée. Assurez-vous d'avoir renseigné une paire de clé.

source: Product unavailable
fr: Produit indisponible

source: Upgrade for
fr: Débloquez pour

source: No purchase to restore
fr: Aucun achat à restaurer

source: noRestaurationMessage
fr: Assurez-vous d'avoir déjà acheté un produit avec votre identifiant Apple actuel.

source: Restore purchases failed.
fr: La réstauration de vos achats a échouée

source: error0002
fr: ##ERROR## Une erreur interne empêche l'application d'accéder à vos informations sauvegardées. Veuillez contacter le développeur avec le code erreur : ##DATA/KI.SWIFT#0002# 🛠

source: ERROR : Please verify that your public key is correct
fr: ERREUR : Veuillez verifier que votre clé publique est correcte.

source: ERROR : Impossible to get the public key associated
fr: ERREUR : Impossible d'obtenir la clé publique associée

source: The video is downloading
fr: La vidéo se télécharge

source: downloadingVideoMessage
fr: Le téléchargement de la vidéo n'est pas encore fini. Voulez-vous recommencer le téléchargement ?

source: Keep downloading
fr: Continuer le téléchargement

source: Re-start the download
fr: Relancer le téléchargement

source: Stop the download
fr: Arrêter le téléchargement

source: Impossible to download the video ?
fr: Problèmes pour télécharger la vidéo ?

source: Loading the video (10 MO) ...
fr: Chargement de la vidéo (8 MO) ...

source: Error occured while downloading the video.
fr: Erreur survenue lors du chargement de la vidéo

source: Impossible to watch the video ?
fr: Problème pour regarder la vidéo ?

source: How to add a new public key
fr: Ajouter une clé publique ?

source: addKey
fr: ajoutCle

source: encryption
fr: chiffrement

source: decrytpion
fr: dechiffrement

source: encryption.MP4
fr: encryption_french.MP4

source: decryption.MP4
fr: decryption_french.MP4

source: addKey.MP4
fr: addKey_french.MP4

source: Loading the video (6 MO) ...
fr: Chargement de la vidéo (6 MO) ...

source: Try again
fr: Ré-essayer

source: How to encrypt
fr: Comment chiffrer

source: How to decrypt
fr: Comment déchiffrer

source: Fatal error
fr: Erreur fatale

source: keyRetrieveFailedMessage
fr: Impossible de trouver cette clé. Veuillez vérifier que vous n'avez fait aucune erreur, que vous avez installé la dernière version d'iLocked et que vous avez assez d'espace disponible sur votre appareil

source: Delete the tuorial videos
fr: Supprimer les videos de tuto

source: ✨ iLocked upgraded version ✨
fr: ✨ iLocked version premium ✨

source: Thank you ! ❤️
fr: Merci ! ❤️

source: Thanks for supporting the app and the developer ! Enjoy your premium app ! 🔥
fr: Merci de supporter l'application et le développeur ! Amusez-vous bien avec la version premium ! 🔥

source: Open logs
fr: Ouvrir les logs

source: impossibleToDecrypt
fr: iLocked ne peut pas déchiffrer ce texte. Veuillez ré-essayer ou chiffrer un nouveau message

source: Impossible to read the logs.
fr: Impossible de lire les logs

source: Impossible to retrieve any data of the QRCode
fr: Impossible de récupérer les données du QRCode

source: The QRCode doesn't contain a public key
fr: Le QRCode ne contient pas de clé publique

source: Invalid data. Cannot be read
fr: Données incorrectes. Impossible de lire

source: Invalid QRCode version. Cannot be read
fr: Version du QRCode invalide. Impossible de lire

source: The QRCode data is corrupted
fr: Les données du QRCode sont corrompues

source: Data type unknown. Impossible to decode
fr: Type de donnée inconnu. Impossible de décoder

source: The data integrity cannot be checked. Decoding prohibited
fr: Intégrité des données non verifiable. Décodage interdit.

source: Invalid format. Cannot be read
fr: Format invalide. Impossible de lire.

source: Shortcut
fr: Raccourcis

source: Plain text
fr: Format texte

source: Share as :
fr: Partager en :

source: Error 🚧. Please try again.
fr: Erreur 🚧. Veuillez ré-essayer.

source: Impossible to generate the QRCode.
fr: Impossible de générer le QRCode.

source: Scanning not supported
fr: Scann non supporté

source: noCameraSupport
fr: Votre appareil ne support pas le scan de QRCode. Utilisez un appareil avec une caméra
